_gsdata_/_saved_/app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT "items".* FROM "items" WHERE ("items".order_id = 1)

  def create
    @item = Item.new(params[:item])
    @item.order = @order

    respond_to do |format|
      if @item.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1
INSERT INTO "items" ("product_id", "quantity_despatched", "created_at", "order_id", "price", "quantity_ordered", "updated_at") VALUES (1, 0, '2011-06-03 10:09:31.453125', NULL, 0, 9, '2011-06-03 10:09:31.453125')