_gsdata_/_saved_/app/views/orders/_form.html.erb

SELECT "monograms".* FROM "monograms"
---
    <%= f.label :monogram %><br />
    <%= f.collection_select(:id, Monogram.all, :id, :description) %>