_gsdata_/_saved_/app/views/orders/index.html.erb

SELECT "items".* FROM "items" WHERE ("items".order_id = 1)
---
    </tr>
    <% order.items.each do |item| %>